<template>
  <v-card elevation="0">
    <v-card-title>更新记录</v-card-title>
    <v-card-text>
      2021/11/25 （By
      StageChan）又更了一大堆，包括查看封面按钮，修改密码功能，优化移动端网页体验等。<br />
      2021/11/07 （By StageChan）更了一些网页计算器工具以及网页使用指南。<br />
      2021/09/28 （By
      StageChan）更了一大堆，包括高级设置中的各种筛选、表列选择和暗色主题；DX分数相关；
      鼠标浮动在曲名和难度上显示谱面信息、浮动在DX
      Rating上显示后续分数线等等。修了一堆bug。<br />
      2021/09/06 更新了查询牌子的功能。<br />
      2021/07/16 更新了天界 2 的歌曲数据，以及相对难度从现在开始按照 SSS
      的人数进行排名了。<br />
      2021/03/18
      加载动画和按难度/定数筛选，你们要的筛选来了。顺便加了个可以看全曲的功能。<br />
      2021/02/26 发布 1.0
      版本，添加了登出按钮，并优化了一些成绩导入方式。提供了代理服务器供便捷导入成绩。<br />
      2021/02/17 废弃了目前在使用的移动端（Vuetify さいこう！），导出为 csv
      增加了一个二次确认窗口。以及优化了所有的对话框。<br />
      2021/02/15 添加了导出为 csv
      的功能。在导入的页面源代码有问题时新增了报错提示。<br />
      2021/02/10 更改了UI。废弃了微信扫码登录的功能和导出为截图的功能。<br />
      2020/12/12
      大家都在买东西，我在加功能。增加了使用微信扫码导入数据的功能。<br />
      2020/09/26 修正了ENENGY SYNERGY MATRIX的乐曲定数，补充了セイクリッド
      ルイン的定数。增加了评级标签和FC/FS标签<br />
      2020/09/10
      教师节快乐！增加了登录、注册和数据同步的功能，增加了修改单曲完成率的功能，不需要再反复导入数据了<br />
      2020/09/02 增加了导出为截图的功能，增加了Session High⤴ 和 バーチャルダム
      ネーション 的 Master 难度乐曲定数<br />
      2020/08/31 发布初版
    </v-card-text>
  </v-card>
</template>

<script>
export default {};
</script>

<style>
</style>